In [3]:
import pandas as pd
import numpy as np

In [11]:
np.random.seed(20)
np.random.rand(3,100) 
employee_random={ 
    "emp_id":np.random.randint(100,200,100),
    "emp_name":np.random.choice(['Abhishek','Kumar','Singh','Ranjan','Ankit','Vikash'],100),
    "basic_month_sal":np.random.randint(20000,50000,100),
}

df_random=pd.DataFrame(employee_random)
print(df_random)

    emp_id  emp_name  basic_month_sal
0      158     Kumar            31890
1      124    Ranjan            20076
2      125  Abhishek            22667
3      115    Vikash            22205
4      161    Ranjan            35594
..     ...       ...              ...
95     118     Kumar            30008
96     192     Singh            40189
97     120     Kumar            34839
98     128     Ankit            43093
99     177     Kumar            24986

[100 rows x 3 columns]

In [28]:
df_random['perf_rating']=np.random.choice(['1','2','3','4','5'],100)
print(df_random)

    emp_id  emp_name  basic_month_sal  cal_avg_salary  gross_month_sal  \
0      158     Kumar            31890        34433.39          38268.0
1      124    Ranjan            20076        34433.39          24091.2
2      125  Abhishek            22667        34433.39          27200.4
3      115    Vikash            22205        34433.39          26646.0
4      161    Ranjan            35594        34433.39          42712.8
..     ...       ...              ...             ...              ...
95     118     Kumar            30008        34433.39          36009.6
96     192     Singh            40189        34433.39          48226.8
97     120     Kumar            34839        34433.39          41806.8
98     128     Ankit            43093        34433.39          51711.6
99     177     Kumar            24986        34433.39          29983.2

   perf_rating
0            1
1            3
2            2
3            3
4            3
..         ...
95           1
96           5
97           1
98           4
99           2

[100 rows x 6 columns]

In [29]:
cal_avg_salary=df_random['basic_month_sal'].mean()
print(f"Average Salary of Employees: {cal_avg_salary}")

Average Salary of Employees: 34433.39

In [18]:
df_random.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 3 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   emp_id           100 non-null    int32
 1   emp_name         100 non-null    object
 2   basic_month_sal  100 non-null    int32
dtypes: int32(2), object(1)
memory usage: 1.7+ KB

In [30]:
df_random.describe()

           emp_id  basic_month_sal  cal_avg_salary  gross_month_sal
count  100.000000       100.000000    1.000000e+02       100.000000
mean   146.110000     34433.390000    3.443339e+04     41320.068000
std     31.068479      8866.094964    1.462523e-11     10639.313957
min    100.000000     20076.000000    3.443339e+04     24091.200000
25%    117.000000     26819.250000    3.443339e+04     32183.100000
50%    144.500000     35630.500000    3.443339e+04     42756.600000
75%    173.250000     41127.500000    3.443339e+04     49353.000000
max    199.000000     49787.000000    3.443339e+04     59744.400000

In [22]:
df_random['cal_avg_salary'] = df_random['basic_month_sal'].mean()
df_random.head()

   emp_id  emp_name  basic_month_sal  cal_avg_salary
0     158     Kumar            31890        34433.39
1     124    Ranjan            20076        34433.39
2     125  Abhishek            22667        34433.39
3     115    Vikash            22205        34433.39
4     161    Ranjan            35594        34433.39

In [32]:
df_random['gross_month_sal'] = df_random['basic_month_sal'] + (0.1 * df_random['basic_month_sal']) + (0.2 * df_random['basic_month_sal'])
df_random.head()

,emp_id,emp_name,basic_month_sal,cal_avg_salary,gross_month_sal,perf_rating
0,158,Kumar,31890,34433.39,41457.0,1
1,124,Ranjan,20076,34433.39,26098.8,3
2,125,Abhishek,22667,34433.39,29467.1,2
3,115,Vikash,22205,34433.39,28866.5,3
4,161,Ranjan,35594,34433.39,46272.2,3